In [2]:
from pathlib  import Path
import pandas as pd 

data_dir = Path("/home/sonujha/rnd/Loan-Approval-Prediction/data/")

In [3]:
df = pd.read_csv(data_dir/'train.csv')

In [4]:
df.shape

(58645, 13)

In [6]:
df.head()

,id,person_age,person_income,person_home_ownership,person_emp_length,loan_intent,loan_grade,loan_amnt,loan_int_rate,loan_percent_income,cb_person_default_on_file,cb_person_cred_hist_length,loan_status
0,0,37,35000,RENT,0.0,EDUCATION,B,6000,11.49,0.17,N,14,0
1,1,22,56000,OWN,6.0,MEDICAL,C,4000,13.35,0.07,N,2,0
2,2,29,28800,OWN,8.0,PERSONAL,A,6000,8.90,0.21,N,10,0
3,3,30,70000,RENT,14.0,VENTURE,B,12000,11.11,0.17,N,5,0
4,4,22,60000,RENT,2.0,MEDICAL,A,6000,6.92,0.10,N,3,0

In [8]:
df.id.nunique()

58645

In [16]:
df.loan_status.value_counts() / len(df)

loan_status
0    0.857618
1    0.142382
Name: count, dtype: float64

In [20]:
loan1 = df.loc[df['loan_status'] == 1]

In [22]:
loan1.head()

,id,person_age,person_income,person_home_ownership,person_emp_length,loan_intent,loan_grade,loan_amnt,loan_int_rate,loan_percent_income,cb_person_default_on_file,cb_person_cred_hist_length,loan_status
11,11,22,33000,RENT,6.0,PERSONAL,B,10000,11.12,0.30,N,2,1
24,24,22,30000,RENT,3.0,MEDICAL,D,5000,16.49,0.17,N,4,1
25,25,25,25000,RENT,3.0,VENTURE,C,3500,13.49,0.14,Y,3,1
38,38,30,54000,RENT,0.0,MEDICAL,B,12500,11.71,0.24,N,10,1
39,39,22,32000,RENT,6.0,EDUCATION,D,8000,15.58,0.25,N,3,1

**Age vs Loan Status**

In [28]:
tmp = df.loc[df['loan_status'] == 1][['loan_status', 'person_age']].reset_index(drop=True)
tmp.head()

   loan_status  person_age
0            1          22
1            1          22
2            1          25
3            1          30
4            1          22